woka/woka_backend/controllers/ApiController.php

SELECT * FROM `wokav_suso_order` WHERE `id`='1'
SELECT * FROM `wokav_suso_ys` WHERE `oid`='1'
INSERT INTO `wokav_suso_ys` (`oid`, `price`, `compensatory`, `freight`, `all`) VALUES (1, '3', '0', '3', '3')
---
    public function actionSaveYs()
    {
        $redata=[
            'status'=>0,
            'message'=>'success'
            ];
        $oid=Yii::$app->request->post('oid');
        $price=Yii::$app->request->post('price');
        $compensatory=Yii::$app->request->post('compensatory');
        $mdoel=SusoOrder::findOne($oid);
        if($mdoel)
        {
            $modelYs=SusoYs::findOne(['oid'=>$oid]);
            if(!$modelYs)
            {
                $modelYs=new SusoYs();
                $modelYs->oid=$oid;
            }

            $modelYs->price=$price;
            $modelYs->compensatory=$compensatory;
            $modelYs->freight=$price * $mdoel->tonnage;
            $modelYs->all=  $modelYs->freight +$compensatory;
            if($modelYs->save())