woka/woka_backend/controllers/TmsYingfuController.php

SELECT * FROM `wokav_suso_point_list` WHERE `oid`='1' ORDER BY `date` DESC
SELECT * FROM `wokav_suso_yf` WHERE `oid`='1' ORDER BY `id` DESC
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $modlePoints=SusoPointList::find()
                           ->where(['oid'=>$id])
                           ->orderBy('date desc')
                           ->all();
        $modelYf=SusoYf::find()
                    ->where(['oid'=>$id])
                    ->orderBy('id desc')
                    ->all();

SELECT * FROM `wokav_suso_order` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = SusoOrder::findOne($id)) !== null) {