woka/woka_backend/controllers/TmsYingshouController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $modlePoints=SusoPointList::find()
                    ->where(['oid'=>$id])
                    ->orderBy('date desc')
                    ->all();
        $modelYs=SusoYs::find()
                    ->where(['oid'=>$id])
                    ->orderBy('id desc')
                    ->one();
---
SELECT * FROM `wokav_suso_point_list` WHERE `oid`='1' ORDER BY `date` DESC
SELECT * FROM `wokav_suso_ys` WHERE `oid`='1' ORDER BY `id` DESC

    protected function findModel($id)
    {
        if (($model = SusoOrder::findOne($id)) !== null) {
---
SELECT * FROM `wokav_suso_order` WHERE `id`='1'