woka/wokaextend/wechat/config/WechatConfig.php

  public  static  function  getCongfig($wxid=1,$update=false)
  {
      $cacheWX=yii::$app->cacheWX;
      $configWX = $cacheWX->get('WXConfig-'.$wxid);
      if ($configWX === false  || $update === true) {
          $modelAccount=WechatAccount::findOne($wxid);
---
SELECT * FROM `wokav_wechat_account` WHERE `id`=1